<?php
$access_token = 'kimeIkhXon3CjV2oBQDdvzI15V7Fe0eIt7gvjAVghuSyvAkhQYJ+fb/M4XQdLe/sQILujSmdpeWT8GZlQcHRa3c0hK5b28DGTxLp87VY+aISKQnm12R2OjRnrIwKZTywvZtwfusYYzCcp0veGI/U7QdB04t89/1O/w1cDnyilFU=';
if($_GET['post'] == '1'){
	$groupid[] = array('C5ca58854e5e7ae33964770acadc0211d','test');
	/*	
	$groupid[] = array('C0f30acaa7ce585a786e0bfb4afc6ba94','ขายของออนไลน์');
	$groupid[] = array('Cddc9221a10312fc4d4e2bf0abebb537d','กลุ่มขายของ#2');
	$groupid[] = array('C2a59c1358911b2ca9e2648e967113ad6','ช้อปปิ้งออนไลน์0');
	$groupid[] = array('Ca50339a267e2c0d17c0254976452070e','woo');
	$groupid[] = array('C1d928e7a66b686c47096843cfa54aea5','hotvip4');
	$groupid[] = array('Cfb706767723304e5d44b91789bed6ac1','eiei');
	
	$groupid[] = array('C7637dca57b09b0b7a88243ce49895ac6','กลุ่ม sexphone 18+');
	
	
	$groupid[] = array('C024ff6d8bb7414a952bc620da8942384','gsawanrak');
	$groupid[] = array('C6551e5a95a2f80d6311b296b21676cca','peodklongwao');
	$groupid[] = array('C44bd3b2fd00f81a47563fa9f8deb3653','mangkonnimitr');
	
	$groupid[] = array('Cdcbc1ac3c747ec546fdd194c0fbf7b1f','clipgaysab');
	$groupid[] = array('C16bffe43b165df3429a722dde84adcfc','konrakphone');
	$groupid[] = array('C04ae8ed4e3d9f6e8de35cd48639b85c0','peodkkongwao1');
	*/
	$id[] = 'เทคนิคและวิธีโพสต์สินค้าในไลน์ให้ขายดี 2018'; $title[]= 'สอนโปรโมท โพสต์โฆษณาอย่างไรให้เด่น สะดุดตา แบบมืออาชีพ';  $thumb[] = 'https://www.img.in.th/images/3d4ed988b8d35b0517a01b7a8152db17.jpg';
	$id[] = 'โพสต์โฆษณาให้เด่นและปังกว่าใคร'; $title[]= 'โพสโฆษณาด้วยรูปแบบต่างๆ ที่ใครเห็นก็ต้องกดดู'; $thumb[] = 'https://www.img.in.th/images/f2de649746267a9556855833d96f357a.jpg';
	$id[] = 'ส่ง Rich Message ได้ฟรีๆ'; $title[]= 'ส่งข้อความภาพแบบเต็มจอโดยไม่ต้องเสียเงินสักบาท'; $thumb[] = 'https://www.img.in.th/images/3305912fa6e44c8246dcc9f5e0c0beee.jpg';
	$id[] = 'สอนดึงไลน์ LINE@ เข้ากลุ่ม'; $title[]= 'วันนี้คุณสามารถนำแอคเคาท์ LINE@ เข้าร่วมกลุ่มได้แล้ว';  $thumb[] = 'https://www.img.in.th/images/41dcccb59e66641db783b7b492166823.jpg';
	$id[] = 'โพสต์สินค้าหลายกลุ่มพร้อมกัน'; $title[]= 'กระจายโฆษณาของคุณไปยังกลุ่มนับพันได้ฟรี โดยที่คุณไม่ต้องเข้ากลุ่ม'; $thumb[] = 'https://www.img.in.th/images/cddf08fd9d6032bd9b8aeb28e8c572c1.jpg';
	$id[] = 'ทำให้ไลน์รู้จักลูกค้าของคุณ'; $title[]= 'สร้างความประทับใจ ให้ LINE@ ของคุณสามารถเรียกชื่อลูกค้าของคุณได้'; $thumb[] = 'https://www.img.in.th/images/594186f26141568d5bb51f5bbec1dbb5.jpg';
	$id[] = 'ส่งแบบฟอร์มให้ลูกค้าได้ง่ายๆ'; $title[]= 'สร้างความน่าเชื่อถือที่มากกว่าคนอื่น ด้วยแบบฟอร์มในไลน์'; $thumb[] = 'https://www.img.in.th/images/a0bd6d6ed1c6036a68265b53f0835921.jpg';
	$id[] = 'ควบคุมได้ทุกอย่างในแอปไลน์'; $title[]= 'เพิ่มความสะดวกสบาย และน่าอัศจรรย์ด้วยการส่งลูกค้าไปทุกที่ที่ต้องการ'; $thumb[] = 'https://www.img.in.th/images/1a4ca077e8c6f9c1421072958a4306df.jpg';
	$id[] = 'ตอบกลับได้มากกว่า 5 ข้อความ'; $title[]= 'จะกี่ข้อความก็ส่งได้ไม่มีปัญหา ทิ้งข้อจำกัดทั้งข้อความต้อนรับและตอบกลับอัตโนมัติ'; $thumb[] = 'https://www.img.in.th/images/af83d26d25a1131f06404fdb56ce4472.jpg';
	$id[] = 'เทคนิคอื่นๆ อีกมากมาย'; $title[]= 'เทคนิคที่ไม่เคยมีใครสอนมาก่อน สอนฟรีเพียง 1 กลุ่ม เต็มปิดลิงก์ทันที รีบเข้า!'; $thumb[] = 'https://www.img.in.th/images/b9e2d3455c31d2e0a10c662eae1106e5.jpg';
	for ($x = 0; $x <= count($groupid)-1; $x++) {
		
	/*
		$card = array([
			'type' => 'text',
			'text' => 'แสดงตัวอย่างการโพสต์ภาพแบบเต็มจอแบบ Rich Message โดยไม่ต้องลงทุน'
		      ],
		     [
		     'type' => 'imagemap',
  			"baseUrl"=> "https://i.imgur.com/pHeEc3g.jpg",
			"altText" => 'มาแบ่งปันกลุ่มกัน!',
			"baseSize" => array(
			    'height' => 1040,
			    'width' => 1040
			    ),
			  'actions' =>  array([
						 'type' => 'uri',
          					"linkUri" => "line://ti/p/%40gkw1117o",
						 "area" => array(
						    'x' => 0,
						    'y' => 0,
						    'height' => 1040,
						    'width' => 1040
						    )
						])
			]
			);
*/
/*
	$card = array([
		'type' => 'template',
	    "altText" => 'สอนโปรโมท โพสต์โฆษณาในไลน์อย่างไรให้เด่น สะดุดตา วิธีใหม่ปี 2018',
		"template" => array(
						'type' => 'carousel',
						'columns' => array([
								'thumbnailImageUrl' => $thumb[0],
								'imageBackgroundColor' => '#000000',
								'title' => $id[0],
								'text' => $title[0],
								'actions' =>  array([
									'type' => 'uri',
									'label' => '➡ เข้าร่วมคอร์สนี้',
									'uri' => 'line://ti/p/%40gkw1117o'
															])
								],[
								'thumbnailImageUrl' => $thumb[1],
								'imageBackgroundColor' => '#000000',
								'title' => $id[1],
								'text' => $title[1],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'ดึง LINE@ เข้ากลุ่ม'
															])
								],[
								'thumbnailImageUrl' => $thumb[2],
								'imageBackgroundColor' => '#000000',
								'title' => $id[2],
								'text' => $title[2],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'กระจายโฆษณา'
															])
								],[
								'thumbnailImageUrl' => $thumb[3],
								'imageBackgroundColor' => '#000000',
								'title' => $id[3],
								'text' => $title[3],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'โพสต์สินค้าให้เด่น'
															])
								],[
								'thumbnailImageUrl' => $thumb[4],
								'imageBackgroundColor' => '#000000',
								'title' => $id[4],
								'text' => $title[4],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'โพสต์ Rich Message'
															])
								],[
								'thumbnailImageUrl' => $thumb[5],
								'imageBackgroundColor' => '#000000',
								'title' => $id[5],
								'text' => $title[5],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'ไลน์รู้จักฉัน?'
															])
								],[
								'thumbnailImageUrl' => $thumb[6],
								'imageBackgroundColor' => '#000000',
								'title' => $id[6],
								'text' => $title[6],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'การส่งแบบฟอร์ม'
															])
								],[
								'thumbnailImageUrl' => $thumb[7],
								'imageBackgroundColor' => '#000000',
								'title' => $id[7],
								'text' => $title[7],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'การกำหนดเส้นทาง'
															])
								],[
								'thumbnailImageUrl' => $thumb[8],
								'imageBackgroundColor' => '#000000',
								'title' => $id[8],
								'text' => $title[8],
								'actions' =>  array([
									'type' => 'message',
									'label' => '▶️ ลองความสามารถนี้',
									'text' => 'ข้อความไม่จำกัด'
															])
								],[
								'thumbnailImageUrl' => $thumb[9],
								'imageBackgroundColor' => '#000000',
								'title' => $id[9],
								'text' => $title[9],
								'defaultAction' =>  array(
									'type' => 'uri',
									'label' => '➡ เข้าร่วมคอร์สนี้',
									'uri' => 'line://ti/p/%40gkw1117o'
									),
								'actions' =>  array([
									'type' => 'uri',
									'label' => '➡ เข้าร่วมคอร์สนี้',
									'uri' => 'line://ti/p/%40gkw1117o'
															])
								]),
											'imageAspectRatio' => 'rectangle',
											'imageSize' => 'cover'
						)
		]);
	*/	
	/*
		$card = array(
			     [
			     'type' => 'template',
				"altText" => 'มาแบ่งปันกลุ่มกัน!',
				"template" => array(
				    'type' => 'buttons',
				    'text' => 'ขณะนี้ระบบกำลังจัดเก็บกลุ่มใหม่เพิ่มจากเพื่อนๆ ที่เข้ามาร่วมกันแนะนำ หากคุณมีกลุ่มที่อยากแนะนำให้เพื่อนๆ อยากเข้า มาแชร์ลิงก์ของกลุ่มไว้ที่นี่เพื่อให้เพื่อนๆ ได้ค้นหาต่อ',
				    'actions' =>  array(['type' => 'uri',
					 'label' => 'แบ่งปันกลุ่มต่อให้เพื่อน',
					 'uri' => 'https://line.me/R/ti/p/%40gkw1117o'
					],['type' => 'message',
					 'label' => 'แบ่งปันอย่างไร?',
					 'text' => 'แบ่งปันอย่างไร?'
					])
				    )
				]
				);
	
		$data = array('to' => $groupid[$x][0], 'messages' => $card);
		
		$card = array(
		     [
		     'type' => 'imagemap',
  			"baseUrl"=> "https://i.imgur.com/W23qHMJ.jpg",
			"altText" => 'สอนฟรี! ส่ง Rich Message ภาพเต็มจอได้ในกลุ่ม ตามมาเลย',
			"baseSize" => array(
			    'height' => 1040,
			    'width' => 1040
			    ),
			  'actions' =>  array([
						 'type' => 'uri',
          					"linkUri" => "line://ti/p/%40gkw1117o",
						 "area" => array(
						    'x' => 0,
						    'y' => 0,
						    'height' => 1040,
						    'width' => 1040
						    )
						])
			]
			);
		
		
		$card = array(
		     [
		     'type' => 'imagemap',
  			"baseUrl"=> "https://i.imgur.com/afNC69v.jpg",
			"altText" => 'รับแลกกลุ่ม ด่วน❗️',
			"baseSize" => array(
			    'height' => 1040,
			    'width' => 1040
			    ),
			  'actions' =>  array([
						 'type' => 'uri',
          					"linkUri" => "line://ti/p/%40gkw1117o",
						 "area" => array(
						    'x' => 0,
						    'y' => 0,
						    'height' => 1040,
						    'width' => 1040
						    )
						])
			]
			);
	*/	
		
		
		$card = array(
		     [
		     'type' => 'imagemap',
  			"baseUrl"=> "https://i.imgur.com/MA1Fmka.jpg",
			"altText" => '🎉 ลดถึง 50%❗️ ทุกบริการ ออกแบบภาพโฆษณา แต่ง-ถ่ายภาพสินค้า สำหรับธุรกิจและร้านค้าของคุณ งานคุณภาพสูง ราคาโดน ลูกค้าซื้อแน่นอน!',
			"baseSize" => array(
			    'height' => 1040,
			    'width' => 1040
			    ),
			  'actions' =>  array([
						'type' => 'message',
          					"label" => "ดูตัวอย่างผลงาน ออกแบบภาพโฆษณา",
          					"text" => "ดูตัวอย่างผลงาน ออกแบบภาพโฆษณา",
						 "area" => array(
						    'x' => 0,
						    'y' => 0,
						    'height' => 520,
						    'width' => 520
						    )
						],[
						'type' => 'message',
          					"label" => "ดูตัวอย่างผลงาน ไดคัตและแต่งภาพสินค้า",
          					"text" => "ดูตัวอย่างผลงาน ไดคัตและแต่งภาพสินค้า",
						 "area" => array(
						    'x' => 520,
						    'y' => 0,
						    'height' => 520,
						    'width' => 520
						    )
						],[
						'type' => 'message',
          					"label" => "ดูตัวอย่างผลงาน ถ่ายภาพสินค้า",
          					"text" => "ดูตัวอย่างผลงาน ถ่ายภาพสินค้า",
						 "area" => array(
						    'x' => 0,
						    'y' => 520,
						    'height' => 520,
						    'width' => 520
						    )
						],[
						'type' => 'uri',
          					"linkUri" => "line://ti/p/%40giy8621v",
						 "area" => array(
						    'x' => 520,
						    'y' => 520,
						    'height' => 520,
						    'width' => 520
						    )
						])
			],[
     'type' => 'template',
	"altText" => '🎉 ลดถึง 50%❗️ ทุกบริการ ออกแบบภาพโฆษณา แต่ง-ถ่ายภาพสินค้า สำหรับธุรกิจและร้านค้าของคุณ งานคุณภาพสูง ราคาโดน ลูกค้าซื้อแน่นอน!',
						"template" => array(
						    'type' => 'buttons',
	'text' => '🎉 งานออกแบบโฆษณาคุณภาพ ราคาโดน วันนี้ลดราคาพิเศษ! สำหรับธุรกิจและร้านค้าออนไลน์ถึง 50% งานราคาหลักร้อยคุณภาพหลักพัน สวยจนลูกค้าต้องซื้อแน่นอน! ลองกดดูตัวอย่างงานที่ต้องการได้ด้านบนเลยนะครับ',
						    'actions' =>  array([
						  'type' => 'uri',
						 'label' => 'สอบถามรายละเอียด',
						 'uri' => 'line://ti/p/%40giy8621v'
						])
	  					  )
	]
			);
		
		$data = array('to' => $groupid[$x][0], 'messages' => $card);
				// Make a POST Request to Messaging API to reply to sender
				$url = 'https://api.line.me/v2/bot/message/push';
				$post = json_encode($data);
				$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);
				$ch = curl_init($url);
				curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
				curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
				curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
				curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
				curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
				$result = curl_exec($ch);
				curl_close($ch);
				echo $result . "\r\n";
	} 
}
